// --створити масив та вивести його в консоль:
// - з 5 числових значень
// let arr = [1,2,3,4,5]
// console.log(arr)
// - з 5 стічкових значень
// let arr = ['1','12', 'ddfdd', '2dcxcvd', 'sdfsdf']
// console.log(arr)
// - з 5 значень стрічкового, числового та булевого типу
// let arr =[1,'df',false, true, '3eef']
// console.log(arr)
// -- Створити пустий масив. Наповнити його будь-якими значеннями звертаючись до конкретного індексу. Вивести в консоль
// let arr =[...arr];
// console.log(arr[2])
// - За допомогою циклу for і document.write() вивести 10 блоків div c довільним текстом всередині
// for (let i = '<div>2</div>'; i < 10; i++) {
//   console.log(i);
// }
// for (let i = 0; i < 10; i++) {
//   arr = arr + i;
// }
// document.write(arr);
// - За допомогою циклу for і document.write() вивести 10 блоків div c довільним текстом і індексом всередині
// for (let i = 0; i < 10; i++) {
//   console.log(i + "<div>5</div>");
// }
// - За допомогою циклу while вивести в документ 20 блоків h1 c довільним текстом всередині.
// for (let i = 0; i < 20; i++) {
//   console.log(i + "<h1>10</h1>");
// }
// - За допомогою циклу while вивести в документ 20 блоків h1 c довільним текстом і індексом всередині.
// for (let i = 0; i < 20; i++) {
//   console.log(i + "<h1>10</h1>");
// }
// - Створити масив з 10 числових елементів. Вивести в консоль всі його елементи в циклі.
// let arr =[...'0123456789'];
// console.log(arr)
// - Створити масив з 10 строкрових елементів. Вивести в консоль всі його елементи в циклі.
// let arr =['0', '1','2','3','4','5','6','7','8','9'];
// for(let number in arr)
// console.log(number)
// - Створити масив з 10 елементів будь-якого типу. Вивести в консоль всі його елементи в циклі.
// let emptyArray =[1,'df',false, true, '3eef']
// emptyArray.forEach(element => {console.log(element);});
// - Створити масив з 10 елементів числового, стірчкового і булевого типу. За допомогою if та typeof вивести тільки булеві елементи
// let emptyArray =[1,'df',false, true, '3eef']
// for(let i = 0; i < emptyArray.length; i++) {
// if (typeof emptyArray[i] === 'boolean') {
//     console.log(emptyArray[i])
// }
// - Створити масив з 10 елементів числового, стірчкового і булевого типу. За допомогою if та typeof вивести тільки числові елементи
// let anArray = [12, 'House', 34, 65, 34, true, 'car'];
// for (i = 0; i < anArray.length; i++) {
//     if (typeof (anArray[i]) == 'number') {
//         console.log(anArray[i]);
//     }
// }
// - Створити масив з 10 елементів числового, стрічкового і булевого типу. За допомогою if та typeof вивести тільки рядкові елементи
// let emptyArray =[1,'df',false, true, '3eef']
// for(let i = 0; i < emptyArray.length; i++) {
// if (typeof emptyArray[i] === 'string') {
//     console.log(emptyArray[i])
// }
// - Створити порожній масив. Наповнити його 10 елементами (різними за типами) через звернення до конкретних індексів. Вивести в консоль всі його елементи в циклі.
// let arr = [];
// arr[0] = 'Lviv';
// arr[1] = 'Odessa';
// arr[3] = 23;
// arr[4] = 19;
// arr[5] = true;
// arr[6] = false;
// arr[7] = true;
// arr[8] = 'efgh';
// arr[9] = 34;
// for (i = 0;i < arr.length; i++){
//     console.log(arr[i]);
// }
// - Створити цикл for на 10  ітерацій з кроком 1. Вивести поточний номер кроку через console.log та document.write
// for (let i = 0; i < 10; i++)
// console.log('step:', i)
// document.write('step:', i)
// - Створити цикл for на 100 ітерацій з кроком 1. Вивести поточний номер кроку через console.log та document.write
// for (let i = 0; i < 100; i++)
// console.log('step:', i)
// document.write(`step: ${i}`)
// - Створити цикл for на 100 ітерацій з кроком 2. Вивести поточний номер кроку через console.log та document.write
// for (let i = 0; i < 200; i = i + 2)
// console.log('step:', i)
// document.write(`step: ${i}`)
// - Створити цикл for на 100 ітерацій. Вивести тільки парні кроки. через console.log + document.write
// for (let i = 0; i < 100; i++)
// if(i % 2 === 0) {
// console.log('step:', i)
// document.write(`step: ${i}`)
// }
// - Створити цикл for на 100 ітерацій. Вивести тільки парні кроки. через console.log + document.write
// - Створити цикл for на 100 ітерацій. Вивести тільки непарні кроки. через console.log + document.write
// for (let i = 0; i < 100; i++)
// if(i % 2 === 1) {
// console.log('step:', i)
// document.write(`step: ${i}`)
// }
// - Відтворити роботу годинника, відрахувавши 2 хвилини (2 цикли! 1й - хвилини, 2й - секунди)
// - Відтворити роботу годинника, відрахувавши  2 години 20 хвилини (3 цикли! 1й - години, 2й - хвилини, 3й - секунди)
// const time = 59;
// let sec = 0;
// let hour = 0;
// let minuts = 0;
// for (let i = 0; i <= 23 && hour !==3 && minuts !== 21; i++) {
//   console.log('hour :', hour++);
//   for (let i = 0; i <= time && hour !==3 && minuts !== 21; i++) {
//     console.log('minuts :', minuts++);
//     for (let i = 0; i <= time; i++) {
     
//       sec++;
//     }
//     sec=0;
//   }
//   minuts=0;
// }
// Додатково
// - Дано масив: [ 'a', 'b', 'c'] . За допомогою циклу for зібрати всі букви в слово.
// let anArray = ['a', 'b', 'c']
// let arr = ''; 
// for (let i = 0; i < anArray.length; i++) {
// arr = arr + anArray[i];
// }
// console.log(arr)


// - Дано масив: [ 'a', 'b', 'c'] . За допомогою циклу while зібрати всі букви в слово.
// let anArray = ['a', 'b', 'c']
// let arr = ''; 
// let i = 0;
// while (i < anArray.length) {
// arr = arr + anArray[i];
// i++;
// }
// console.log(arr)

// - Дано масив: [ 'a', 'b', 'c'] . За допомогою циклу for of зібрати всі букви в слово.
// let anArray = ['a', 'b', 'c']
// let arr = ''; 
// for (const string of anArray) {
// arr = arr + string;
// }
// console.log(arr)
// - Дано масив: [ 'a', 'b', 'c'] . За допомогою циклу for of зібрати всі букви в слово.
// let anArray = ['a', 'b', 'c']
// let arr = ''; 
// for (const string in anArray) {
// arr = arr + anArray[string];
// }
// console.log(arr)
// =================
// =================
// =================
// =================

// - Дан масив ['a', 'b', 'c']. Додайте йому в кінець елементи 1, 2, 3 за допомогою циклу.
// let anArray = ['a', 'b', 'c'];
// for(let i = 1; i <= 3; i++) {
//   anArray.push(i);
// }
// console.log(anArray)
// - Дан масив [1, 2, 3]. Зробіть з нього новий масив [3, 2, 1].
// let anArray = ['1', '2', '3'];
// let otherArr = anArray.reverse();
// console.log(otherArr)
// - Дан масив [1, 2, 3]. Додайте йому в кінець елементи 4, 5, 6.
// let anArray = [1, 2, 3];
// for(let i = 4; i <= 6; i++) {
//   anArray.push(i);
// }
// console.log(anArray)
// - Дан масив [1, 2, 3]. Додайте йому в початок елементи 4, 5, 6.
// let anArray = [1, 2, 3];
// for(let i = 6; i >= 4; i--) {
//   anArray.unshift(i);
// }
// console.log(anArray)
// - Дан масив ['js', 'css', 'jq']. Виведіть на екран перший елемент за допомогою shift()
// let arr =['js', 'css', 'jq'];
// let first = arr.shift();
// console.log(first)
// - Дан масив ['js', 'css', 'jq']. Виведіть на екран останній елемент за допомогою pop()
// let arr =['js', 'css', 'jq'];
// let first = arr.pop();
// console.log(first)
// - Дан масив [1, 2, 3, 4, 5]. За допомогою методу/функції slice перетворіть масив в [4, 5].
// let arr =[1, 2, 3, 4, 5];
// let first = arr.slice(3, 5);

// console.log(first)
// - Дан масив [1, 2, 3, 4, 5]. За допомогою методу/функції slice перетворіть масив в [1,2].
// let arr =[1, 2, 3, 4, 5];
// let first = arr.slice(0, 2);

// console.log(first)
// - Дан масив [1, 2, 3, 4, 5]. За допомогою методу/функції splice перетворіть масив в [1, 4, 5].
// let arr =[1, 2, 3, 4, 5];
// let first = arr.splice(1, 2);
// console.log(arr) 
// - Дан масив [1, 2, 3, 4, 5]. За допомогою методу/функції splice зробіть з нього масив [1, 2, 3, 'a', 'b', 'c', 4, 5].
// let arr =[1, 2, 3, 4, 5];
// let first = arr.splice(3, 0,'a', 'b', 'c' );

// console.log(arr) 
// - Дан масив [1, 2, 3, 4, 5]. За допомогою методу/функції splice зробіть з нього масив [1, 'a', 'b', 2, 3, 4, 'c', 5, 'e'].
// let arr =[1, 2, 3, 4, 5];
// let first = arr.splice(1, 0,'a', 'b');
// let ses = arr.splice(6, 1, 'c');
// // let wew = arr.splice(7, 'e');
// console.log(arr)
// - Взяти масив з 10 чисел або створити його. Вивести в консоль тільки ті елементи, значення яких є парними.
// let arr = [23, 224, 2424, 4545, 455, 44, 434334, 23, 32, 2332]
// for( let i=0; i< arr.length; i++){
//   if( arr[i] % 2 == 0)
//   console.log(arr[i])
// }
// - Взяти масив з 10 чисел або створити його. Створити 2й порожній масив. За допомогою будь-якого циклу та push () скопіювати значення одного масиву в інший
// let arr = [23, 224, 2424, 4545, 455, 44, 434334, 23, 32, 2332]
// let sec = []
// for( let i=0; i< arr.length; i++){
//   sec.push(arr[i])
  
// }
// console.log(sec)
// - Взяти масив з 10 чисел або створити його. Створити 2й порожній масив. За допомогою будь-якого циклу скопіювати значення одного масиву в інший.
// let arr = [23, 224, 2424, 4545, 455, 44, 434334, 23, 32, 2332]
// let sec = []
// for( let i=0; i< arr.length; i++){
//   sec[i] =arr[i]
  
// }
// console.log(sec)

// ============

// зробити масив з 10 чисел [2,17,13,6,22,31,45,66,100,-18]та:
// 1. перебрати його циклом while
// 2. перебрати його циклом for
// 3. перебрати циклом while та вивести  числа тільки з непарним індексом
// 4. перебрати циклом for та вивести  числа тільки з непарним індексом
// 5. перебрати циклом while та вивести  числа тільки парні  значення
// 6. перебрати циклом for та вивести  числа тільки парні  значення
// 7. замінити кожне число кратне 3 на слово "okten"
// let arr = [2,17,13,6,22,31,45,66,100,-18]
// console.log(arr)
// for(let i = 0; i < arr.length; i++){
//   if(arr[i] % 3 === 0){
//     arr[i] = 'okten'
//   }
  
// }
// console.log(arr)
// 8. вивести масив в зворотньому порядку.
// 9. всі попередні завдання (окрім 8), але в зворотньому циклі (с заду на перед)
// 10
//  створити пустий масив та :
// - заповнити його 50 парними числами за допомоги циклу.
// - заповнити його 50 непарними числами за допомоги циклу.
// let arr1 = [];
// let arr2 = [];
// for(let i = 0; i < 50; i++){
//   i % 2  === 0 ? arr1[i] = i : arr2[i] = i
// }
//   console.log(arr1)
//   console.log(arr2)

// 3. используя Math.random заполнить массив из ???(сколько хотите) элементов.
//  диапазон рандома 8 до 732. (но сначала пробуйте БЕЗ ДИАПАЗОНА!)
// let arr1 = [];
// for(let i = 0; i<10; i++) {
//   arr1[i]= Math.floor((Math.random()*732-8)+8)
// }
// console.log(arr1)
//  2. вывести на консоль  каждый третий елемент
// let arr1 = [];
// for(let i = 0; i<10; i++) {
//   arr1[i]= Math.floor((Math.random()*732-8)+8)
// }
// for(let i = 2; i<10; i+=3) {
//   console.log(arr1[i])
// }
//  3. вывести на консоль  каждый третий елемент
//  но при условии что его значение является парным.
// let arr1 = [];
// for(let i = 0; i<10; i++) {
//   arr1[i]= Math.floor((Math.random()*732-8)+8)
// }
// for(let i = 2; i<10; i+=3) {
//   if(arr1[i]%2 === 0) {
//   console.log(arr1[i])
// }
// }
//  4. вывести на консоль  каждый третий елемент
//  но при условии что он имеет парное значение и
//  записать их в другой массив.
// let arr1 = [];
// let arr2 = [];
// for(let i = 0; i<10; i++) {
//   arr1[i]= Math.floor((Math.random()*732-8)+8)
// }
// for(let i = 2; i<10; i+=3) {
//   if(arr1[i]%2 === 0) {
//   arr2.push(arr1[i])
// }
// }
// console.log(arr2)
//  5. Вывести каждый елемент массива у которого соседний с права элемент - парный
// let arr1 = [];
// for(let i = 0; i<10; i++) {
//   arr1[i]= Math.floor((Math.random()*732-8)+8)
// }
// for(let i = 0; i<arr1.length; i+=3) {
//   if(arr1[i+1]%2 === 0) {
//     console.log(arr1[i])
// }
// }

//   5 масив з числами [100,250,50,168,120,345,188], Які характеризують вартість окремої покупки. обрахувати середній чек.

// 3 створити масив з рандомними значеннями, помножити всі його елементи на 5 та перемістити їх в інший масив.
// let arr1 = [];
// let arr2 = [];
// for(let i = 0; i<10; i++) {
//   arr1[i]= Math.floor((Math.random()*732-8)+8)
// }
// for(let i = 2; i<10; i+=3) {
//   if(arr1[i]%2 === 0) {
//   arr2.push(arr1[i])
// }
// }
// console.log(arr2)
// 4 створити масив з будь якими значеннями (стрінги, числа, і тд...). пройтись по ньому, і якщо об'єкт є числом,
//  додати його в інший масив.